<?php

/*Задание #1
Создайте переменную $name и присвойте ей строковое значение содержащее Ваше имя.
Создайте переменную $age и присвойте ей строковое значение содержащее Ваш возраст.
Выведите с помощью echo (или print) фразу “Меня зовут: ваше_имя”.
Выведите фразу “Мне ваш_возраст лет”.
Выведите следующий набор символов, включая кавычки - “!|/’”\
(двойная кавычка, воскл. знак, вертикальная черта, обратный слэш, слэш, кавычка, двойная кавычка, обратный слэш).
Каждая фраза должна начинаться с новой строки.*/

$name = 'Elin';
$age = 999;

echo "My name is " . "$name" . '<br>';
echo 'I\'m ' . "$age " . 'years old.';

